Revit 2026 API

# ViewPlanSetUnderlayBaseLevel Method

---

Sets the level whose elevation will determine the bottom of the underlay range. The elevation of the next highest level will be used to determine the top of the underlay range.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetUnderlayBaseLevel(
	ElementId levelId
)
```
```vb
Public Sub SetUnderlayBaseLevel (
	levelId As ElementId
)
```
```cpp
public:
void SetUnderlayBaseLevel(
	ElementId^ levelId
)
```
```fsharp
member SetUnderlayBaseLevel :
        levelId : ElementId -> unit
```

#### Parameters

levelId ElementId
     The element id of a level in the project or else InvalidElementId.

| Exception | Condition |
| --- | --- |
| ArgumentException | The ElementId levelId does not correspond to a Level in the project. |
| ArgumentNullException | A non-optional argument was null |

If the level specified is the highest level, the underlay range will be unbounded. The underlay range will consist of everything above the specified level.

#### Reference

ViewPlan Class

Autodesk.Revit.DB Namespace